
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_consumption_budget_resource_group.grafana-budget-alert[0]
* Update
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
* Delete
  * module.application_insights.azurerm_monitor_action_group.action_group
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_consumption_budget_resource_group.grafana-budget-alert[0] will be created
  + resource "azurerm_consumption_budget_resource_group" "grafana-budget-alert" {
      + amount            = 500
      + etag              = (known after apply)
      + id                = (known after apply)
      + name              = "grafana-budget-alert"
      + resource_group_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat"
      + time_grain        = "Monthly"

      + filter {
          + dimension {
              + name     = "ResourceId"
              + operator = "In"
              + values   = [
                  + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat",
                ]
            }
        }

      + notification {
          + contact_emails = []
          + contact_groups = [
              + "DTSSE Alert (aat)",
            ]
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 90
          + threshold_type = "Forecasted"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2023-09-01T00:00:00Z"
        }
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_action_group.action_group will be destroyed
  # (because azurerm_monitor_action_group.action_group is not in configuration)
  - resource "azurerm_monitor_action_group" "action_group" {
      - enabled             = true -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/actionGroups/Dtsse-Aat-Warning-Alerts" -> null
      - location            = "global" -> null
      - name                = "Dtsse-Aat-Warning-Alerts" -> null
      - resource_group_name = "dtsse-aat" -> null
      - short_name          = "dts-aat" -> null
      - tags                = {
          - "application"         = "core"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#reform-swe"
          - "environment"         = "staging"
          - "managedBy"           = "DTS Software Engineering"
        } -> null

      - azure_function_receiver {
          - function_app_resource_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-alerts-slack-aat/providers/Microsoft.Web/sites/cft-alerts-slack-aat" -> null
          - function_name            = "httpTrigger" -> null
          - http_trigger_url         = (sensitive value) -> null
          - name                     = "slack-alerts" -> null
          - use_common_alert_schema  = true -> null
        }
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached" -> (known after apply)
      ~ name                = "Application Insights daily cap reached" -> "Application Insights daily cap reached - dtsse-appinsights-aat" # forces replacement
        tags                = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
        # (5 unchanged attributes hidden)

      ~ action {
          ~ action_group_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/actionGroups/Dtsse-Aat-Warning-Alerts" -> "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
            # (1 unchanged attribute hidden)
        }

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":134,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->